src/main/resources/templates/verifyOtpUniken/verifyOtpUniken_Request.xml

<SOAP-ENV:Envelope
	xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
	xmlns:e="http://www.technisys.net/cmm/services/errors/v1.0"
	xmlns:md="http://www.technisys.net/cmm/services/metadata/v2.0"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
	<SOAP-ENV:Header>
		<md:metadata>
			<traceNumber>
				170805548818444837509144259594724826341.174331236620762684679273915916385614770</traceNumber>
			<serviceId>verifyOtpUniken</serviceId>
			<serviceVersion>1.0</serviceVersion>
			<sessionId>96619d48-2879-41cf-a2ec-2a2401090928</sessionId>
			<channelId>IN</channelId>
			<targetChannel>
				<mnemonic>IN</mnemonic>
			</targetChannel>
			<organizationType>
				<mnemonic />
			</organizationType>
			<executingChannel>
				<mnemonic>IN</mnemonic>
			</executingChannel>
			<address>ip=201.234.84.213;</address>
			<executingOperatorId>$#{_executing_operator_id_}</executingOperatorId>
			<locale>ES</locale>
			<institutionType />
			<template>
				<templateId />
			</template>
			<channelDispatchDate>20210527095058875-0500</channelDispatchDate>
			<msgTypeId />
			<workflowModule />
			<featureId />
			<sourceDate />
			<workflowId />
			<businessDate />
			<terminalId>Mozilla/5.0 (Windows NT 10.0; Win64; x64)
				AppleWebKit/537.36 (KHTML, like Gecko) Chrome/90.0.4430.212
				Safari/537.36</terminalId>
			<sourceTime />
			<branchId />
			<userId />
			<executingScope />
			<customProperties>
				<operatorId type="java.lang.String" />
				<businessDate type="java.util.Date" />
				<serviceContext type="java.lang.String" />
				<llaveSimetrica type="java.lang.String" />
				<funcCode type="java.lang.String" />
				<terminal type="java.lang.String" />
				<portal type="java.lang.String">PBN</portal>
			</customProperties>
			<llaveSimetrica type="java.lang.String" />
			<organizationOperatorId>userName=TEST</organizationOperatorId>
			<parityCurrencyId />
			<localCurrencyId />
			<institutionId />
			<localCountryId />
			<bankId />
			<ip>201.234.84.213</ip>
			<parityQuotationNemonic />
			<paginationInfo />
			<internals>
				<auditCore>true</auditCore>
				<autoPaginationEnabled>false</autoPaginationEnabled>
				<serviceProviderEntityName>LOCAL</serviceProviderEntityName>
				<serviceProviderName>DINERS</serviceProviderName>
				<translate>true</translate>
				<serviceRequestTimestamp />
			</internals>
		</md:metadata>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<NS3:verifyOtpUnikenRequest
			xmlns:NS3="http://www.technisys.net/cmm/services/verifyOtpUniken/rq/v1.0">
			<customer dataModel="diners.financials" name="customer"
				version="1.0">
				<customerId>1714346234</customerId>
				<token>
					<value></value>
				</token>
			</customer>
			<profile dataModel="diners.financials" name="profile" version="1.0">
				<profileType>
					<mnemonic>S</mnemonic>
				</profileType>
			</profile>
			<establishment dataModel="diners.financials" name="establishment"
				version="1.0">
				<ruc></ruc>
			</establishment>
			<otp dataModel="diners.financials" name="otp" version="1.0">
				<value>915454</value>
				<uuid>03f67f9e-ec4f-11e6-b006-92361f002671</uuid>
			</otp>
			<transaction>
				<type>MON</type>
				<code>ADD</code>
			</transaction>
			<consumer>
				<value></value>
			</consumer>
			<creditCard>
				<entityCode></entityCode>
				<creditCardAccount>
					<brand>
						<mnemonic></mnemonic>
					</brand>
				</creditCardAccount>
			</creditCard>
		</NS3:verifyOtpUnikenRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>